#การเรียง array 2d เป็นชั้นๆ ข้าถึงข้อมูลสมาชิกโดยอ้างอิงจากตำเเหน่ง(index) 3 ค่า คือ[dept][row][column]
import numpy as np
a = np.array([[[1,2,3],[4,5,6]]]) # dept มีเเค่ 1 ชั้น(ชั้นที่0)
print(a)
print(a[0][1][1])
print(a[0][0][2])
print("-----------------------------------------------")
#                   dept0           dept1
b=np.array([[[1, 2, 3], [4, 5, 6]], [[7, 8, 9], [10, 11, 12]]]) #([ [[1,2,3],[4,5,6]], [[7,8,9],[10,11,12]] ])
print(b)
print(b[0][1][2])
print(b[1][0][0])
print(b[1][0][2])
print(b[0][1][1])